
<goals>
    <item>
        <text>Veille : Je consid&egrave;re essentielle une veille constante.<br/>
            Quel que soit le contexte, je dois pouvoir proposer des solutions techniques
            aussi bien que des solutions de gestion modernes.<br/>
            Le faire-savoir autant que le savoir-faire est devenu 
            une qualit&eacute; importante et me permet cette veille.<br/>
            <big>Mon int&eacute;r&ecirc;t continu pour les technologies me permet aujourd'hui d'&ecirc;tre
                leader sur tous les projets, de d&eacute;bloquer les situations complexes, de fournir des pr&eacute;conisations
                sur le d&eacute;veloppement.</big>
            <br/>
            <br/>
        </text>
    </item>
    <item>
        <text>Qualit&eacute; : Mon experience m'a montr&eacute; que les cycles de vie 
            ne doivent pas &ecirc;tre n&eacute;glig&eacute;s,
            les projets internes ont leur importance et ont besoin de support car ils garantissent l'entretien en motivation,
            en mise &agrave; jour technologique et en efficacit&eacute; des ing&eacute;nieurs. 
            L'am&eacute;lioration continue attire de nouvelles opportunit&eacute;s dans les affaires mais aussi dans 
            la sph&egrave;re de comp&eacute;tence des contributeurs. 
            <br/>
            <br/>
        </text>
    </item>
    <item>
        <text>D&eacute;mocratie participative : La gestion est devenue coaching et encouragement,
            plut&ocirc;t que commandement et direction. Et ceci force les chefs de projet et leaders &agrave; rester ouverts
            au talent de leurs employ&eacute;s. Je crois que ces m&eacute;thodes conviennent aux travaux d'&eacute;quipe.
            Je suis par ailleurs intimement persuad&eacute; qu'<i>une chaine est aussi 
                solide que son maillon le plus faible.</i> Le team-building est une notion fondamentale.<br/>
            <br/>
        </text>
    </item>
    <item>
        <text>Un pont se construit entre l'orient et l'occident, 
            je pense avoir un r&ocirc;le de choix dans cette &eacute;tape.</text>
    </item>
	
</goals>
