{
  "links": {
    "about": "About",
    "education": "Education",
    "experience": "Experience",
    "skills": "Skills",
    "interests": "Interests",
    "projects": "Projects",
    "publications": "Publications"
  },
  "personalInfo": {
    "name": "Gregory Anne",
    "lastName": "IT Architect",
    "subHeadingText": [
      "professional software engineering experience since 2009",
      "Consultancy in System designs and Programming",
      "Full Stack Software Engineer",
      "DevOps Enthusiast",
      "Experience crafting small websites to large and complex applications",
      "Provider of support in development and hosting"
    ],
    "city": "Somewhere near Paris, France",
    "phoneNumber": "----",
    "email": "gregory.anne.jobs@gmail.com",
    "linkedin": "https://www.linkedin.com/in/gregoryanne83/",
    "github": "https://github.com/zg2pro/",
    "twitter": "https://twitter.com/zg2pro/",
    "myDescription": "This website doesn't collect any personal data, nor uses any cookies. Regarding all the emails you may have sent me, I will destroy them on simple request."
  },
  "educationDegrees": {
    "title": "Education 📕",
    "degrees": [
      {
        "collage": "TODO",
        "name": "Engineer Degree",
        "itemList": ["Computer Science"],
        "startEndDate": "March 2013 - December 2018"
      }
    ]
  },
  "workExperiences": {
    "title": "Work Experience 🔨",
    "works": [
      {
        "position": "IT Architect",
        "companie": "Prima Solutions",
        "responsabilities": [
          "I joined Prima-Effisoft as an internal staff IT Architect. Our mission is to constantly adapt a product range based on very heterogeneous software solutions, to the today needs of our clients and our prospects, as well as find ways to rationalize both the software architecture and the infrastructures.",
          "We study the technical solutions, we serve as reference for technology watch, and we provide continuous support to the product/development teams. Also, we maintain a shared core software we distribute across various products, or occasionnally take on short cross-disciplinary projects.",
          "In 2022, when business in the US began to expand significantly, Duck Creek Technologies acquired Effisoft and immediately granted us an access to many more customers in the US, APAC and EMEA. ",
          "To follow such an expansion we concentrate our manpower on support for the rebranding, product quality, better time-to-market and a responsive customer service."
        ],
        "environment": "Jira, Conflluence, Gitlab, Java, Linux/WinServer/AWS, PLSQL, Spring-boot, Spring-cloud, Axis2, VueJS, C# XAML, Keycloak",
        "startEndDate": "October 2019 - Present"
      },
      {
        "position": "Java Tech Lead",
        "companie": "SQLI",
        "responsabilities": [
          "SQLI offers solutions for companies' performance challenges. Thus, Allianz Technology, my dedicated client, has trusted us to that end, and I take part as a Technical Analyst. My duties are:",
          "carrying out analyses in various projects in order to control time, budget, and risks",
          "coordinating developments and test teams across the world, and across IT outsourcing partners",
          "homologating the technical aspects of the deliveries, deliver myself",
          "continuously proposing technical enhancement, and create new technical projects"
        ],
        "environment": "Jira, Conflluence, UML, Gitlab, IntelliJ, Java, Jersey, Spring-boot, XSL, Apache Camel, Jms, Elastic stack, AngularJs.",
        "startEndDate": "December 2017 - September 2019"
      },
      {
        "position": "Java Project Manager",
        "companie": "GFI",
        "responsabilities": [
          "My assignment was to develop a software the purpose of which was to help the pre-handling (control, archiving, ciphering, jurisdictions management) of files of the General Inspection division of BNPP, and the upload toward a document management system. One great challenge in the project consisted in enabling the upload of big files and make it resumable. I was the leader of the developers Agile team and thus, I provided technical solutions and I organized the software architecture, I was the referent on most of the technical subjects. I also welcomed and trained the new developers and I maintained our test environments.",
          "Project \"noticeable\" for BNPP group and their first project to be labeled \"secret\". Security was therefore at the heart of the projet."
        ],
        "environment": "JAVA/JEE (Spring4 MVC, Spring-security SSO, Esapi, nCipher crypto library, owasp, JPA2), JQuery, JsTree, Bootstrap Twitter, Oracle DB, Flyway-db, WebSphere, NetBeans, Git, Maven, Sonar, Jira Agile, HP-Quality Center, Jenkins, Automic Ara, Nexus",
        "startEndDate": "October 2015 - November 2017"
      },
      {
        "position": "And before that...",
        "companie": "IBM Global Services + IO-Network + Aptea",
        "responsabilities": [
          "I started as an expat in Vietnam, IBMer in an offshore center dedicated to IBM France. I was as a business analyst a relay between FR and VN. ",
          "I stayed in Vietnam 3 years and actually worked more than 2 years for a local company, having found a position with more important responsabilities than the ones I had at IBM.",
          "Thus, in spite of my youth, I had the honor to manager a 6-person team, and control projects from technical perspective as well as commercially",
          "Our business there was payment solutions, being a partner to KL/Singaporean companies we were offered often great chances to innovate and I learned so many things in so many ways.",
          "After that I came back to France and joined as a dev an IT outsourcing company. There again I learnt many things and focused more and more in the technical field. My technical responsabilities gained significance with time and assignment after assignment."
        ],
        "environment": " SQL Server, Oracle DB, Postgres, Glassfish, Tomcat, JBoss, JAVA/JEE (JPA2, Hibernate, EJB3, JMS, Spring3 MVC, JSF, Maven), AngularJS, JQuery, PHP, Bootstrap Twitter, Lucene, XSL, Digital Signature, SIG, WebDav(Milton), iText, SVN, Mantis, Jenkins, Sonar, Talend, DokuWiki, xWiki, MsProject, Trello, Testlink, UML, BPML, French, English, Manglish",
        "startEndDate": "Febrary 2009 - September 2015"
      }
    ]
  },
  "skills": {
    "title": "Skills 🎯",
    "iconsTitle": "Programming Languages & Tools",
    "devIcons": [
      "devicon-javascript-plain",
      "devicon-html5-plain-wordmark",
      "devicon-css3-plain-wordmark",
      "devicon-git-plain",
      "devicon-bootstrap-plain",
      "devicon-github-original",
      "devicon-gitlab-original",
      "devicon-heroku-original",
      "devicon-jenkins-original",
      "devicon-docker-original",
      "devicon-confluence-original",
      "devicon-linux-plain",
      "devicon-windows8-original",
      "devicon-jquery-plain-wordmark",
      "devicon-vuejs-plain",
      "devicon-angularjs-plain",
      "devicon-backbonejs-plain",
      "devicon-nestjs-plain",
      "devicon-nodejs-plain-wordmark",
      "devicon-php-plain",
      "devicon-java-plain",
      "devicon-spring-plain",
      "devicon-tomcat-plain",
      "devicon-oracle-original",
      "devicon-mysql-plain",
      "devicon-postgresql-plain"
    ],
    "workflow": "Workflow",
    "itemList": [
      "Technology watch : Visits at events dot, devoxx, meetups, test of technologies, documentation and broadcast",
      "Project & Quality management: Operational schedules, BPM, Charge estimation, Tracking, Validation & verification",
      "Agile Development & Scrum",
      "REST API building, Improvement of systems toward cloud compatibility",
      "Specification & Design: UML, SADT, Automatons and Petri nets",
      "Systems administration and devops: setup of test environments and continuous delivery"
    ]
  },
  "interests": {
    "title": "Hobbies 😄",
    "firstBlock": "I like restaurants, museums, cinema, DIY. I love to travel and I have a real passion for Asia.",
    "secondBlock": "These last years, having realized the impact of my carbon footprint, I have adapted my diet and my energy consumption ; ecology and integrity are a big part in my ethics. 🌎"
  },
  "projects": {
    "title": "Personal Projects 🦾🧠",
    "projectsInfo": [
      {
        "name": "CV Gregory Anne: This resume",
        "description": "I've had an online resume since 2004 while I was still at university and did my first arms on PHP. Browse the branches of my github repository and see how I went from a PHP powered xslt website to jquery fullpage.js and finally now nuxt.js",
        "image": "cv-gregory-anne.png",
        "siteUrl": "https://zg2pro.github.io/cv-gregory-anne/",
        "repositoryUrl": "https://github.com/zg2pro/cv-gregory-anne"
      },
      {
        "name": "zg2pro formatter plugin",
        "description": "A maven plugin to automatically format your code (java, scala, groovy, xml) during the validate phase (first phase in mvn lifecycle). It also deploys a git hook. Thus, whatever IDE your team is using, your code will always be kept well formatted and you'll avoid many git conflicts. ",
        "image": "code_rain.png",
        "siteUrl": "https://mvnrepository.com/artifact/com.github.zg2pro.formatter/zg2pro-formatter-plugin",
        "repositoryUrl": "https://github.com/zg2pro/zg2pro-formatter-plugin"
      },
      {
        "name": "PoC: NestJs can also work for frontend frameworks",
        "description": "NestJs is an extension of ExpressJs. But with this code and two examples of integration in a VueJs fw (https://github.com/zg2pro/calculateur-conges-vue) and in an Angular fw (https://github.com/zg2pro/calculateur-conges-angular) I proved that nuxtJs is a good solution to make all kinds of applications, backends, frontends, could actually be written in the same language. ",
        "image": "nest-front.png",
        "siteUrl": "https://docs.nestjs.com/support",
        "repositoryUrl": "https://github.com/zg2pro/calculateur-conges-api"
      },
      {
        "name": "Fork: Elasticsearch-logback-appender",
        "description": "Elasticsearch-logback-appender by internetitem didn't work with https without alterations to the jvm. Mine does. ",
        "image": "simple_elasticsearch_appender.png",
        "siteUrl": "https://mvnrepository.com/artifact/com.github.zg2pro.forks/logback-elasticsearch-appender",
        "repositoryUrl": "https://github.com/zg2pro/logback-elasticsearch-appender"
      },
      {
        "name": "Fork: regex-copy-plugin",
        "description": "Use a regex to copy files and rename them at the same time. ",
        "image": "regex1.png",
        "siteUrl": "https://mvnrepository.com/artifact/com.github.zg2pro.copy/regex-copy-maven-plugin",
        "repositoryUrl": "https://github.com/zg2pro/regex-copy-plugin"
      },
      {
        "name": "Availabilities at Prefecture du Val-de-Marne",
        "description": "Maybe it has changed now but it was extremely hard to get an appointment. Because it was the most efficient way I created this deployed service on heroku that would send me an SMS as soon as a slot would be available for me to take an appointment.",
        "image": "prefecture_val_de_marne.png",
        "siteUrl": "https://dispo-prefecture-94.herokuapp.com/",
        "repositoryUrl": "https://github.com/zg2pro/dispo-prefecture-94"
      },
      {
        "name": "Blackjack in command lines",
        "description": "During a recruitment process, a big American company had given me a challenge: Develop in 48h a blackjack game all in command lines. Here's what I did. I did all that but eventually I joined Prima Solutions. :-)",
        "image": "spades.png",
        "siteUrl": "https://github.com/zg2pro/command-line-blackjack",
        "repositoryUrl": "https://github.com/zg2pro/command-line-blackjack"
      },
      {
        "name": "Spring Safe Setup",
        "description": "There are a few things I like when setting up a system, enough disk space, encoding in utf8 everywhere, all couterparts aligned to GMT. It saves time when of course you don't need to add extra complexity. This lib helps you verifying this kind of things from the application you are going to develop. ",
        "image": "check_logo.jpg",
        "siteUrl": "https://mvnrepository.com/artifact/com.github.zg2pro/spring-safe-setup",
        "repositoryUrl": "https://github.com/zg2pro/spring-safe-setup"
      }
    ]
  },
  "publications": {
    "title": "Publications",
    "itemList": [
      "https://dzone.com/articles/hibernate-versus-jpa",
      "https://dzone.com/articles/jpa-and-other-frameworks",
      "https://dzone.com/articles/spring-ioc-containers-and-static-code-design-princ"
    ]
  }
}
